# Agrupando Dados de um DataFrame
* método groupby

In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('C:\\Series_Temporais\\UDEMY_TSA_FINAL\\pesquisa-covid.csv')

In [7]:
df.head()

   Massa corporal (kg)  Altura (cm)  Idade COVID-19
0                   72          180     31      NÃO
1                   80          170     21      NÃO
2                   60          175     16      NÃO
3                   90          174     28      SIM
4                  100          185     23      SIM

In [8]:
df.shape

(20, 4)

In [9]:
# Agrupando coluna
df_covid = df.groupby('COVID-19')

In [10]:
# Obtendo as médias das informações do meu dataset
df_covid.mean()

          Massa corporal (kg)  Altura (cm)      Idade
COVID-19
NÃO                 75.363636   173.454545  24.727273
SIM                 79.888889   173.555556  27.555556

In [11]:
df_covid.sum()

          Massa corporal (kg)  Altura (cm)  Idade
COVID-19
NÃO                       829         1908    272
SIM                       719         1562    248

## Agrupando os dados do dataset Titanic

In [12]:
df = pd.read_csv('C:\\Series_Temporais\\UDEMY_TSA_FINAL\\titanic_train.csv')

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df_survived = df.groupby('Survived')

In [17]:
df_survived.mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [18]:
df_sex = df.groupby('Sex').mean()

In [19]:
df_sex

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893